### Big Data Analysis 

- SQL (Structured Query Language) is a ,jor programming language in the database development field. The biggest difference between SQL and other programming languages, such as Java and Python is the language design logic.

* The syntax of SQL focused on teh logic of **grouping**; while most other programming languages focus more on **proceedure**, which uses liner thinking. 

##### SQL Data Structure

**General Database Structure**

<img width="823" alt="General Database Structure " src="https://github.com/user-attachments/assets/dc7514f9-5a26-4546-a79c-979b96266446">

- The figure above describes what the architecture looks like in a typical database software ecosystem. The most valuable part of the database is the data itself. Different types of data can be stored.

**What is Primary key**:

The Primary Key is a vital part of each table in the database system. It can be any column or a group of multiple columns, and there can only be one primary key in a table. The value cannot be repeated or null.

##### Data Type
- **Number**

1) `INT`
2) `Double`, `Float`, `Decimal`

- **Datetime**
1) `Date`
2) `Month`
3) `Year
4) `Datetime`
5) Timestamp

- **TEXT**:
1) `Char`
2) `Varchar`

#### Special Data Types:
1) BINARY
2) BLOB
3) BOOLEAN

In [1]:
%logstop
%matplotlib inline
import matplotlib
import seaborn as sns
sns.set()
matplotlib.rcParams['figure.dpi'] = 144

Logging hadn't been started.

In [2]:
%load_ext sql
%sql sqlite:///testdb.sqlite

In [3]:
%reload_ext sql
%sql sqlite:///testdb.sqlite

In [18]:
%%sql
--# The %%sql magic tells Jupyter to interpret this cell as SQL
--# In SQL comments begin with "--" (we add # to take advantage of Jupyter's syntax highlighting)

--# Since we're starting a new example, let's delete any existing tables
DROP TABLE IF EXISTS customers;
DROP TABLE IF EXISTS products;
DROP TABLE IF EXISTS orders;
DROP TABLE IF EXISTS employees;

--# Now let's make our tables
CREATE TABLE customers (
    id                 INTEGER PRIMARY KEY NOT NULL,
    name               TEXT NOT NULL,
    billing_address    TEXT NOT NULL
);

CREATE TABLE products (
    id                 INTEGER PRIMARY KEY NOT NULL,
    price              NUMBER NOT NULL
);

CREATE TABLE orders (
    id                 INTEGER NOT NULL,
    customer_id        NUMBER NOT NULL,
    product_id         NUMBER NOT NULL,
    delivery_address   TEXT NOT NULL,
    FOREIGN KEY(customer_id) REFERENCES customers(id),
    FOREIGN KEY(product_id) REFERENCES products(id)
);

 * sqlite:///testdb.sqlite
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

```
SELECT name, sql FROM sqlite_master
WHERE type='table'
ORDER BY name;
```

In [5]:
%%sql
SELECT * FROM sqlite_master;

 * sqlite:///testdb.sqlite
Done.

[('table', 'customers', 'customers', 3, 'CREATE TABLE customers (\n    id                 INTEGER PRIMARY KEY NOT NULL,\n    name               TEXT NOT NULL,\n    billing_address    TEXT NOT NULL\n)'),
 ('table', 'products', 'products', 4, 'CREATE TABLE products (\n    id                 INTEGER PRIMARY KEY NOT NULL,\n    price              NUMBER NOT NULL\n)'),
 ('table', 'orders', 'orders', 2, 'CREATE TABLE orders (\n    id                 INTEGER NOT NULL,\n    customer_id        NUMBER NOT NULL,\n    product_id         NUMBER NOT NULL,\n    delivery_address   TEXT NOT NULL,\n    FOREIGN KEY(customer_id) REFERENCES customers(id),\n    FOREIGN KEY(product_id) REFERENCES products(id)\n)')]

### Create Tables:
* Employees Table

In [105]:
%%sql

--# Since we're starting a new employees table, let's delete any existing tables
DROP TABLE IF EXISTS employees;


CREATE TABLE employees(
    ID                   INT NOT NULL ,
    FirstName            TEXT NOT NULL,
    LastName             VARCHAR(255) NOT NULL,
    Salary               INTEGER NOT NULL ,
    Departments           VARCHAR(255),
    PRIMARY KEY (ID)
    
);

 * sqlite:///testdb.sqlite
Done.
Done.

[]

In [106]:
%%sql

INSERT INTO employees (ID, FirstName, LastName, Salary, Departments)
    VALUES (2351, 'Omar', 'Hossan', 65000, 'IT'), (2352, 'Stuart', 'Kenneth', 95000, 'Customer'), (6127, 'Vidhya', 'Samuel', 120000, 'Commercial'), (9532, 'Prab', 'Vidha', 90000, 'Engineering'), (8241, 'Bala', 'Yet', 80000, 'Digitaltwin'), (4328, 'Eva', 'Chandra', 11000, 'Data Engineering'), (5890, 'Hank', 'Frank', 75000, 'Data Science'), (8240, 'Grace', 'Charlie', 80000, 'Digitaltwin'), (3250, 'Kiran', 'David', 95000, 'Safety');

 * sqlite:///testdb.sqlite
9 rows affected.

[]

In [107]:
%%sql

SELECT 
    * 
FROM 
    employees

 * sqlite:///testdb.sqlite
Done.

[(2351, 'Omar', 'Hossan', 65000, 'IT'),
 (2352, 'Stuart', 'Kenneth', 95000, 'Customer'),
 (6127, 'Vidhya', 'Samuel', 120000, 'Commercial'),
 (9532, 'Prab', 'Vidha', 90000, 'Engineering'),
 (8241, 'Bala', 'Yet', 80000, 'Digitaltwin'),
 (4328, 'Eva', 'Chandra', 11000, 'Data Engineering'),
 (5890, 'Hank', 'Frank', 75000, 'Data Science'),
 (8240, 'Grace', 'Charlie', 80000, 'Digitaltwin'),
 (3250, 'Kiran', 'David', 95000, 'Safety')]

In [108]:
%%sql

SELECT 
    * 
FROM 
    employees 
ORDER BY 
    Salary DESC;

 * sqlite:///testdb.sqlite
Done.

[(6127, 'Vidhya', 'Samuel', 120000, 'Commercial'),
 (2352, 'Stuart', 'Kenneth', 95000, 'Customer'),
 (3250, 'Kiran', 'David', 95000, 'Safety'),
 (9532, 'Prab', 'Vidha', 90000, 'Engineering'),
 (8241, 'Bala', 'Yet', 80000, 'Digitaltwin'),
 (8240, 'Grace', 'Charlie', 80000, 'Digitaltwin'),
 (5890, 'Hank', 'Frank', 75000, 'Data Science'),
 (2351, 'Omar', 'Hossan', 65000, 'IT'),
 (4328, 'Eva', 'Chandra', 11000, 'Data Engineering')]

In [86]:
%%sql

SELECT 
    FirstName, 
    LastName, 
    Departments, 
    Salary,
    DENSE_RANK() OVER(ORDER BY Salary DESC) AS Ranks
FROM employees;

 * sqlite:///testdb.sqlite
Done.

[('Vidhya', 'Samuel', 'Commercial', 120000, 1),
 ('Stuart', 'Kenneth', 'Customer', 95000, 2),
 ('Kiran', 'David', 'Safety', 95000, 2),
 ('Prab', 'Vidha', 'Engineering', 90000, 3),
 ('Bala', 'Yet', 'Digitaltwin', 80000, 4),
 ('Grace', 'Charlie', 'Digitaltwin', 80000, 4),
 ('Hank', 'Frank', 'Data Science', 75000, 5),
 ('Omar', 'Hossan', 'IT', 65000, 6),
 ('Eva', 'Chandra', 'Data Engineering', 11000, 7)]

In [87]:
%%sql

SELECT 
    FirstName, 
    LastName, 
    Departments, 
    Salary,
    DENSE_RANK() OVER(PARTITION BY Departments) AS Ranks
FROM employees;

 * sqlite:///testdb.sqlite
Done.

[('Vidhya', 'Samuel', 'Commercial', 120000, 1),
 ('Stuart', 'Kenneth', 'Customer', 95000, 1),
 ('Eva', 'Chandra', 'Data Engineering', 11000, 1),
 ('Hank', 'Frank', 'Data Science', 75000, 1),
 ('Bala', 'Yet', 'Digitaltwin', 80000, 1),
 ('Grace', 'Charlie', 'Digitaltwin', 80000, 1),
 ('Prab', 'Vidha', 'Engineering', 90000, 1),
 ('Omar', 'Hossan', 'IT', 65000, 1),
 ('Kiran', 'David', 'Safety', 95000, 1)]

**CTE**

In [99]:
%%sql

WITH Salary_Ranks 
AS (
SELECT 
    FirstName, 
    LastName, 
    Departments, 
    Salary,
    DENSE_RANK() OVER(ORDER BY Salary DESC) AS Ranks
FROM employees
)

SELECT * FROM Salary_Ranks --WHERE Ranks=3

 * sqlite:///testdb.sqlite
Done.

[('Vidhya', 'Samuel', 'Commercial', 120000, 1),
 ('Stuart', 'Kenneth', 'Customer', 95000, 2),
 ('Kiran', 'David', 'Safety', 95000, 2),
 ('Prab', 'Vidha', 'Engineering', 90000, 3),
 ('Bala', 'Yet', 'Digitaltwin', 80000, 4),
 ('Grace', 'Charlie', 'Digitaltwin', 80000, 4),
 ('Hank', 'Frank', 'Data Science', 75000, 5),
 ('Omar', 'Hossan', 'IT', 65000, 6),
 ('Eva', 'Chandra', 'Data Engineering', 11000, 7)]

In [98]:
%%sql

WITH Salary_Ranks 
AS (
SELECT 
    FirstName, 
    LastName, 
    Departments, 
    Salary,
    DENSE_RANK() OVER(ORDER BY Salary DESC) AS Ranks
FROM employees
)

SELECT Salary, Ranks FROM Salary_Ranks WHERE Ranks=3

 * sqlite:///testdb.sqlite
Done.

[(90000, 3)]

In [111]:
%%sql

WITH Salary_Ranks 
AS (
SELECT 
    FirstName, 
    LastName, 
    Departments, 
    Salary,
    ROW_NUMBER() OVER(ORDER BY Salary DESC) AS RN,
    RANK() OVER(ORDER BY Salary DESC) AS Ranks, 
    DENSE_RANK() OVER(ORDER BY Salary DESC) AS DEN_Ranks
FROM employees
)

SELECT *  FROM Salary_Ranks

 * sqlite:///testdb.sqlite
Done.

[('Vidhya', 'Samuel', 'Commercial', 120000, 1, 1, 1),
 ('Stuart', 'Kenneth', 'Customer', 95000, 2, 2, 2),
 ('Kiran', 'David', 'Safety', 95000, 3, 2, 2),
 ('Prab', 'Vidha', 'Engineering', 90000, 4, 4, 3),
 ('Bala', 'Yet', 'Digitaltwin', 80000, 5, 5, 4),
 ('Grace', 'Charlie', 'Digitaltwin', 80000, 6, 5, 4),
 ('Hank', 'Frank', 'Data Science', 75000, 7, 7, 5),
 ('Omar', 'Hossan', 'IT', 65000, 8, 8, 6),
 ('Eva', 'Chandra', 'Data Engineering', 11000, 9, 9, 7)]

##--------------------------------------------------------------------------------------------

In [62]:
%%sql

--#DROP world Table if EXISTS

DROP TABLE IF EXISTS World;

CREATE TABLE World (
    name            INT NOT NULL,
    continent      TEXT NOT NULL,
    area            INT NOT NULL,
    population      INT NOT NULL,
    gdp             INT NOT NULL,
    PRIMARY KEY (name)
)

 * sqlite:///testdb.sqlite
Done.
Done.

[]

In [63]:
%%sql

INSERT INTO World (name, continent, area, population, gdp) 
VALUES('Afghanistan', 'Asia', 652230, 25500100, 20343000000), ('Albania', 'Europe', 28748, 2831741, 12960000000), ('Algeria', 'Africa', 2381741, 37100000, 188681000000), ('Andorra', 'Europe', 468 , 78115, 3712000000 ), ('Angola', 'Africa', 1246700 , 20609294 , 100990000000 )

 * sqlite:///testdb.sqlite
5 rows affected.

[]

* A country is **big** if:

- it has an area of at least three million `(i.e., 3000000 km2)`, or
- it has a population of at least twenty-five million `(i.e., 25000000)`.

* Write a solution to find the name, population, and area of the big countries.

* Return the result table in any order.

In [64]:
%%sql

SELECT name, area, population 
FROM world 
WHERE area >= 3000000
OR population >= 25000000;

 * sqlite:///testdb.sqlite
Done.

[('Afghanistan', 652230, 25500100), ('Algeria', 2381741, 37100000)]

In [ ]:
%%sql

SELECT 
    employee_id,
    salary,
    CASE 
        WHEN employee_id % 2 = 1 AND name NOT LIKE 'M%' THEN salary
        ELSE 0
    END AS bonus
FROM 
    employees
ORDER BY 
    employee_id;

In [ ]:
%%sql

WITH PrimeNumbers AS (
    SELECT employee_id
    FROM employees
    WHERE employee_id > 1
    AND NOT EXISTS (
        SELECT 1 
        FROM generate_series(2, floor(sqrt(employee_id))) AS series
        WHERE employee_id % series = 0
    )
)
SELECT 
    e.employee_id,
    e.salary,
    CASE 
        WHEN p.employee_id IS NOT NULL AND e.name NOT LIKE 'M%' THEN e.salary
        ELSE 0
    END AS bonus
FROM 
    employees e
LEFT JOIN 
    PrimeNumbers p ON e.employee_id = p.employee_id
ORDER BY 
    e.employee_id;

In [ ]:
%%sql

SELECT 
    employee_id,
    salary,
    CASE 
        WHEN employee_id % 2 = 0 AND name NOT LIKE 'M%' THEN salary
        ELSE 0
    END AS bonus
FROM 
    employees
ORDER BY 
    employee_id;